# Pandas
Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.4.2

In [5]:
import numpy as np
df=pd.DataFrame(np.arange(0,25).reshape(5,5),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4","Column5"])

In [6]:
df

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [9]:
df.iloc[0]

Column1    0
Column2    1
Column3    2
Column4    3
Column5    4
Name: Row1, dtype: int32

In [11]:
print(df.loc["Row1"])

Column1    0
Column2    1
Column3    2
Column4    3
Column5    4
Name: Row1, dtype: int32

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int32
 1   Column2  5 non-null      int32
 2   Column3  5 non-null      int32
 3   Column4  5 non-null      int32
 4   Column5  5 non-null      int32
dtypes: int32(5)
memory usage: 312.0+ bytes

In [13]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [14]:
df.iloc[:,1:]

      Column2  Column3  Column4  Column5
Row1        1        2        3        4
Row2        6        7        8        9
Row3       11       12       13       14
Row4       16       17       18       19
Row5       21       22       23       24

In [15]:
df.iloc[:1,:]

      Column1  Column2  Column3  Column4  Column5
Row1        0        1        2        3        4

In [16]:
df.iloc[1:,:]

      Column1  Column2  Column3  Column4  Column5
Row2        5        6        7        8        9
Row3       10       11       12       13       14
Row4       15       16       17       18       19
Row5       20       21       22       23       24

In [17]:
df.isnull()

      Column1  Column2  Column3  Column4  Column5
Row1    False    False    False    False    False
Row2    False    False    False    False    False
Row3    False    False    False    False    False
Row4    False    False    False    False    False
Row5    False    False    False    False    False

In [19]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
Column5    0
dtype: int64